# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerIterator..::..Dispose Method
RebarContainerIterator Class See Also
---
Releases all resources used by the RebarContainerIterator
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# See Also
RebarContainerIterator Class
Autodesk.Revit.DB.Structure Namespace